//лекция 9.12.24
#include <iostream>
#include <algorithm>
#include <vector>

using namespace std;

int main(){
    //побитовые операции

    int i = 1;
    //0000 0000 0000 0000 0000 0000 0000 0000 = 1

    cout<<sizeof(i)<<endl;
    //4 //переменная занимает в памяти 4 байта, 32 бита

    cout<<"before: "<<i<<endl;
    //1
    i = i << 1;
    //0000 0000 0000 0000 0000 0000 0000 0010 = 2
    cout<<"after: "<<i<<endl;
    //2
    i = i << 1;
    //0000 0000 0000 0000 0000 0000 0000 0100 = 4   
    cout<<"after: "<<i<<endl;
    //4

    cout<<(1 | 2) << endl;  //операция или
    //3

    //0000 0000 0000 0000 0000 0000 1111 1111 = 255   
    //0000 0000 0000 0000 0000 0000 1111 1010 = 250 
    cout<<(255 & 250) << endl;  //операция и
    //250
    cout << (255 | 250) << endl;
    //0000 0000 0000 0000 0000 0000 1111 1101 = 253
    cout<<(255 ^ 250)<<endl;  //операция исключающее или
    //7
    cout << (255 >> 2) << endl;
    return 0;
}