/* 
по курсачу - любой ЯП на выбор; выбрать движок, технологии или библиотеки;
выбрать платформу; вид программы.

содержание пояснительной записки: введение (объем - 1 страница); 
аналитический обзор (2 страницы):
обзор аналогов, отличия от аналогов, анализ использования алгоритмов и методов и обходов; 
требования к программе (10-15 требований): сторонним наблюдателям поалагется понятие что необходимо разработать;
описание технологий (2 страницы):
пояснение, почему выбран тот или иной ЯП, среда разработки, платформа, технология тд и тп;
5. архитектура (2 страницы): например - диаграмма классов,
архитектура компонентов, архитектура сцен;
6. алгоритмы (2 страницы, блок схема и словесное описание);
7. разработка программного кода (5 страниц) фрагменты кода тыры пыры туда сюда че куда че кому и нихуя;
8. пример работы программы (3 страницы);
9. заключение (1 страница) подвести итого по поводу того, что разработано, т.е. какие этапы были проделаны и какие были решены задачи. дальнейшее развитие продукта.
10. список литературы
11. приложения, программный код
 */





/* Паттерный шаблон. Шаблон действий. Плохие способы программирования */
/* Минусы:
1. программирование !?простаты?!, а не, копирование программы, копипаста паттерна тд и тп. распространяются ошибки.
2. увеличение объема кода. чем кода больше - тем сложнее в нем разобраться.
3. код сложнее модифицировать. 
4. код сложно переносить.
*/
/* Плюсы:a, auto b
1. копаривание программы - быстро.
2.  
*/